Repository: PatilShreya22/KrishiLink
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: hi, mr

source: KrishiLink
hi: कृषिलिंक
mr: कृषीलिंक

source: Toggle navigation
hi: नेविगेशन बदलें
mr: नेव्हिगेशन टॉगल करा

source: View All
hi: सभी देखें
mr: सर्व पहा

source: No notifications
hi: कोई नोटिफिकेशन नहीं
mr: कोणतीही सूचना नाही

source: Home
hi: होम
mr: मुख्यपृष्ठ

source: Languages
hi: भाषाएँ
mr: भाषा

source: English
hi: अंग्रेज़ी
mr: इंग्रजी

source: Profile
hi: प्रोफ़ाइल
mr: प्रोफाईल

source: Edit Profile
hi: प्रोफ़ाइल संपादित करें
mr: प्रोफाईल संपादित करा

source: Logout
hi: लॉगआउट
mr: बाहेर पडणे

source: Remove Profile Image
hi: प्रोफ़ाइल छवि हटाएँ
mr: प्रोफाईल प्रतिमा काढा

source: Add New Crop
hi: नई फ़सल जोड़ें
mr: नवीन पीक जोडा

source: Crop Name
hi: फ़सल का नाम
mr: पीकाचे नाव

source: Quantity (in Kg)
hi: मात्रा (किलो में)
mr: प्रमाण (किलोमध्ये)

source: Price (₹/Kg)
hi: कीमत (₹/किलो)
mr: किंमत (₹/किलो)

source: Harvest Date
hi: कटाई की तारीख
mr: सिंकटाचा दिनांक

source: Description / Expectation
hi: विवरण / अपेक्षाएँ
mr: वर्णन / अपेक्षा

source: E.g. Organically grown, expecting fair price and regular buyer.
hi: उदा. जैविक रूप से उगाई गई, उचित मूल्य और नियमित खरीदार की अपेक्षा।
mr: उदा. सेंद्रिय पद्धतीने वाढवलेले, योग्य किंमत आणि नियमित खरेदीदाराची अपेक्षा.

source: Crop Image
hi: फ़सल की छवि
mr: पीक प्रतिमा

source: Image Preview
hi: छवि पूर्वावलोकन
mr: प्रतिमेचे पूर्वावलोकन

source: Delivery Method
hi: वितरण विधि
mr: वितरण पद्धत

source: -- Select Delivery Method --
hi: -- वितरण विधि चुनें --
mr: -- वितरण पद्धत निवडा --

source: Farmer Delivers
hi: किसान डिलीवर करेगा
mr: शेती करणारा वितरित करतो

source: Buyer Pickup
hi: खरीदार उठाएगा
mr: खरेदीदार उठवतो

source: Add Crop
hi: फ़सल जोड़ें
mr: पीक जोडा

source: KrishiLink. All Rights Reserved.
hi: कृषिलिंक। सर्व अधिकार सुरक्षित।
mr: कृषीलिंक. सर्व हक्क राखीव.

source: KrishiLink Logo
hi: कृषिलिंक लोगो
mr: कृषीलिंक लोगो

source: Search crops...
hi: फसल खोजें...
mr: पीक शोधा...

source: Search
hi: खोजें
mr: शोधा

source: Cart
hi: कार्ट
mr: कार्ट

source: Orders
hi: ऑर्डर
mr: ऑर्डर

source: Your Wallet
hi: आपका वॉलेट
mr: आपला वॉलेट

source: Close
hi: बंद करें
mr: बंद करा

source: Current Balance:
hi: वर्तमान बैलेंस:
mr: सध्याचा शिल्लक:

source: Add Amount
hi: राशि जोड़ें
mr: रक्कम जोडा

source: UPI ID
hi: यूपीआई आईडी
mr: UPI आयडी

source: example@upi
hi: उदाहरण@upi
mr: उदाहरण@upi

source: Add Money
hi: पैसे जोड़ें
mr: रक्कम जोडा

source: You can see payments here after selling crops.
hi: फसल बेचने के बाद आप यहां भुगतान देख सकते हैं।
mr: आपण इथे पीके विकल्यानंतर केलेली पेमेंट्स पाहू शकता.

source: Crops Matching Your Preferences
hi: आपकी पसंद के अनुरूप फ़सलें
mr: आपल्या पसंतीला जुळणारी पीके

source: Price:
hi: कीमत:
mr: किंमत:

source: Not specified
hi: निर्दिष्ट नहीं
mr: निर्दिष्ट नाही

source: Add to Cart
hi: कार्ट में जोड़ें
mr: कार्टमध्ये जोडा

source: Buy Now
hi: अभी खरीदें
mr: आता खरेदी करा

source: Farmer
hi: किसान
mr: शेतकरी

source: No crops available matching your preferences at the moment.
hi: इस समय आपकी पसंद के अनुरूप कोई फ़सल उपलब्ध नहीं है।
mr: सध्या आपल्या पसंतीला जुळणारी कोणतीही पीके उपलब्ध नाहीत.

source: Newly Added Crops
hi: नई जोड़ी गई फ़सलें
mr: नवीन जोडलेली पीके

source: No other crops available right now.
hi: इस समय कोई अन्य फ़सल उपलब्ध नहीं है।
mr: सध्या इतर कोणतीही पीके उपलब्ध नाहीत.

source: Buyer
hi: खरीदार
mr: खरेदीदार

source: Company:
hi: कंपनी:
mr: कंपनी:

source: Business Type:
hi: व्यवसाय का प्रकार:
mr: व्यवसाय प्रकार:

source: Preferred Crops:
hi: पसंदीदा फ़सलें:
mr: पसंतीची पीके:

source: Email:
hi: ईमेल:
mr: ईमेल:

source: Phone:
hi: फ़ोन:
mr: फोन:

source: Location / Address:
hi: स्थान / पता:
mr: ठिकाण / पत्ता:

source: 🏠 Home
hi: 🏠 होम
mr: 🏠 मुख्यपृष्ठ

source: 🛒 Cart
hi: 🛒 कार्ट
mr: 🛒 कार्ट

source: 📦 Orders
hi: 📦 ऑर्डर
mr: 📦 ऑर्डर

source: 🛒 Your Cart
hi: 🛒 आपका कार्ट
mr: 🛒 आपला कार्ट

source: Crop
hi: फ़सल
mr: पीक

source: Price
hi: कीमत
mr: किंमत

source: Quantity
hi: मात्रा
mr: प्रमाण

source: Total
hi: कुल
mr: एकूण

source: Remove
hi: हटाएँ
mr: काढा

source: Total:
hi: कुल:
mr: एकूण:

source: Checkout
hi: चेकआउट
mr: चेकआउट

source: Your cart is empty.
hi: आपका कार्ट खाली है।
mr: आपला कार्ट रिकामा आहे.

source: Complete Profile
hi: प्रोफ़ाइल पूर्ण करें
mr: प्रोफाईल पूर्ण करा

source: Complete Your Profile
hi: अपनी प्रोफ़ाइल पूरी करें
mr: आपला प्रोफाईल पूर्ण करा

source: Phone Number
hi: फ़ोन नंबर
mr: फोन नंबर

source: Full Address
hi: पूरा पता
mr: पूर्ण पत्ता

source: e.g., Lane 2, Hiranandani, Thane West, Maharashtra
hi: जैसे, लेन 2, हिरेनंदनी, ठाणे वेस्ट, महाराष्ट्र
mr: उदा., लेन २, हिरानंदानी, ठाणे वेस्ट, महाराष्ट्र

source: Pincode
hi: पिनकोड
mr: पिनकोड

source: e.g., 400607
hi: जैसे, 400607
mr: उदा., ४००६०७

source: Use GPS to Fill Location
hi: स्थान भरने के लिए GPS का उपयोग करें
mr: ठिकाण भरण्यासाठी GPS वापरा

source: Upload Your Photo
hi: अपना फ़ोटो अपलोड करें
mr: आपली फोटो अपलोड करा

source: Bank Account Number
hi: बैंक खाता संख्या
mr: बँक खाते क्रमांक

source: Bank account number must be 9 to 18 digits
hi: बैंक खाता संख्या 9 से 18 अंकों की होनी चाहिए
mr: बँक खाते क्रमांक ९ ते १८ अंकांचा असावा

source: Short Bio / About You
hi: संक्षिप्त विवरण / आपके बारे में
mr: संक्षिप्त परिचय / तुमच्याबद्दल

source: I am a farmer from Pune, growing organic vegetables for 10 years.
hi: मैं पुणे का किसान हूँ, पिछले 10 वर्षों से जैविक सब्ज़ियाँ उगा रहा हूँ।
mr: मी पुण्यातील शेतकरी आहे, गेल्या १० वर्षांपासून सेंद्रिय भाजीपाला उगवत आहे.

source: Land Size (acres)
hi: भूमि का आकार (एकड़ में)
mr: जमिनीचा आकार (एकर)

source: Farm Type
hi: खेती का प्रकार
mr: शेतीचा प्रकार

source: Select type
hi: प्रकार चुनें
mr: प्रकार निवडा

source: Irrigated
hi: सिंचित
mr: सिंचित

source: Rainfed
hi: मानसून आधारित
mr: पर्जन्य-निर्भर

source: Plantation
hi: प्लांटेशन
mr: वनस्पती लागवड

source: Horticulture
hi: बागवानी
mr: बागायती पिके

source: Organic
hi: जैविक
mr: सेंद्रिय

source: Company Name
hi: कंपनी का नाम
mr: कंपनीचे नाव

source: Business Type
hi: व्यवसाय का प्रकार
mr: व्यवसाय प्रकार

source: Select business type
hi: व्यवसाय का प्रकार चुनें
mr: व्यवसायाचा प्रकार निवडा

source: Wholesaler
hi: थोक व्यापारी
mr: घाऊक विक्रेता

source: Retailer
hi: खुदरा व्यापारी
mr: सुपरमार्केट / किरकोळ विक्रेता

source: Exporter
hi: निर्यातक
mr: निर्यातदार

source: Manufacturer
hi: निर्माता
mr: उत्पादक

source: Preferred Crops
hi: पसंदीदा फ़सलें
mr: पसंतीची पीके

source: Wheat
hi: गेहूँ
mr: गहू

source: Rice
hi: चावल
mr: तांदूळ

source: Maize
hi: मक्का
mr: मका

source: Tomato
hi: टमाटर
mr: टोमॅटो

source: Potato
hi: आलू
mr: बटाटा

source: Onion
hi: प्याज
mr: कांदा

source: Other Crops (comma-separated)
hi: अन्य फ़सलें (कॉमा से अलग करें)
mr: इतर पीके (कॉमा ने विभाजित)

source: Enter crops not listed above
hi: ऊपर सूचीबद्ध नहीं फ़सलें दर्ज करें
mr: वरील सूचीतील नसलेली पीके प्रविष्ट करा

source: Submit
hi: सबमिट करें
mr: सबमिट करा

source: Hindi
hi: हिन्दी
mr: हिंदी

source: Marathi
hi: मराठी
mr: मराठी

source: Edit Crop
hi: फ़सल संपादित करें
mr: पीक संपादित करा

source: Current Crop Image
hi: वर्तमान फ़सल की छवि
mr: सध्याची पीक प्रतिमा

source: Status
hi: स्थिति
mr: स्थिती

source: Available
hi: उपलब्ध
mr: उपलब्ध

source: Not Available
hi: उपलब्ध नहीं
mr: उपलब्ध नाही

source: Sold
hi: बिका हुआ
mr: विक्री झाले

source: Update Crop
hi: फ़सल अपडेट करें
mr: पीक अद्यतनित करा

source: 💡 You can see payments here after selling crops.
hi: 💡 फसल बेचने के बाद आप यहां भुगतान देख सकते हैं।
mr: 💡 येथे आपण पीके विकल्यानंतर केलेली पेमेंट पाहू शकता.

source: Current Weather in
hi: वर्तमान मौसम
mr: सध्याचे हवामान

source: Temperature:
hi: तापमान:
mr: तापमान:

source: Feels Like:
hi: महसूस होता है:
mr: अनुभवलेले तापमान:

source: Humidity:
hi: नमी:
mr: आर्द्रता:

source: Wind Speed:
hi: हवा की गति:
mr: वारा वेग:

source: Condition:
hi: स्थिति:
mr: स्थिती:

source: Weather Icon
hi: मौसम आइकन
mr: हवामान चिन्ह

source: Weather Alert:
hi: मौसम चेतावनी:
mr: हवामान इशारा:

source: Your Crops
hi: आपकी फ़सलें
mr: आपली पीके

source: Quantity (Kg)
hi: मात्रा (किलो में)
mr: प्रमाण (किलो)

source: Actions
hi: क्रियाएँ
mr: क्रिया

source: Buyers
hi: खरीदार
mr: खरेदीदार

source: Edit
hi: संपादित करें
mr: संपादित करा

source: Are you sure you want to delete this crop?
hi: क्या आप वाकई इस फ़सल को हटाना चाहते हैं?
mr: आपल्याला खरोखरच हे पीक हटवायचे आहे का?

source: Delete
hi: हटाएँ
mr: हटवा

source: Buyer info not available
hi: खरीदार की जानकारी उपलब्ध नहीं
mr: खरेदीदाराची माहिती उपलब्ध नाही

source: Not sold yet
hi: अभी तक नहीं बिका
mr: अजून विक्री झाली नाही

source: No crops added yet.
hi: अभी तक कोई फ़सल जोड़ी नहीं गई।
mr: अजून कोणतीही पीके जोडलेली नाहीत.

source: Pending Cash on Delivery Orders
hi: बकाया कैश ऑन डिलीवरी ऑर्डर
mr: प्रलंबित रोख वितरण ऑर्डर

source: Order ID
hi: ऑर्डर आईडी
mr: ऑर्डर आयडी

source: Total Price
hi: कुल कीमत
mr: एकूण किंमत

source: Order Date
hi: ऑर्डर की तारीख
mr: ऑर्डर तारीख

source: Approve
hi: स्वीकृत करें
mr: मंजूर करा

source: Reject
hi: अस्वीकृत करें
mr: नाकार करा

source: No pending orders.
hi: कोई लंबित ऑर्डर नहीं।
mr: कोणतेही प्रलंबित ऑर्डर नाहीत.

source: About:
hi: के बारे में:
mr: बद्दल:

source: Crops Posted:
hi: डाली गई फ़सलें:
mr: जोडलेली पीके:

source: No crops available right now.
hi: इस समय कोई फ़सल उपलब्ध नहीं।
mr: सध्या कोणतीही पीके उपलब्ध नाहीत.

source: Reset Your Password
hi: अपना पासवर्ड रीसेट करें
mr: आपला पासवर्ड रीसेट करा

source: Email
hi: ईमेल
mr: ईमेल

source: New Password
hi: नया पासवर्ड
mr: नवीन पासवर्ड

source: Confirm Password
hi: पासवर्ड पुष्टि करें
mr: पासवर्ड पुष्टी करा

source: Change Password
hi: पासवर्ड बदलें
mr: पासवर्ड बदला

source: Back to Login
hi: लॉगिन पर वापस जाएँ
mr: लॉगिनकडे परत जा

source: Smart Crop Deals
hi: स्मार्ट क्रॉप डील्स
mr: स्मार्ट क्रॉप डील्स

source: About
hi: के बारे में
mr: बद्दल

source: Contact
hi: संपर्क करें
mr: संपर्क

source: Login
hi: लॉगिन
mr: लॉगिन

source: Register
hi: पंजीकरण करें
mr: नोंदणी

source: Language
hi: भाषा

source: Welcome to KrishiLink
hi: क्रिशिलिंक में आपका स्वागत है
mr: कृषी लिंक मध्ये आपले स्वागत आहे

source: Smart Crop Pre-Booking & Rain-Aware Deal Platform
hi: स्मार्ट क्रॉप प्री-बुकिंग और बारिश-सावधान डील प्लेटफ़ॉर्म
mr: स्मार्ट पीक प्री-बुकिंग आणि पर्जन्य-आधारित डील प्लॅटफॉर्म

source: Farm Image 1
hi: खेत की तस्वीर 1
mr: शेती प्रतिमा १

source: Farm Image 2
hi: खेत की तस्वीर 2
mr: शेती प्रतिमा २

source: Farm Image 3
hi: खेत की तस्वीर 3
mr: शेती प्रतिमा ३

source: About KrishiLink
hi: क्रिशिलिंक के बारे में
mr: कृषी लिंक बद्दल

source: KrishiLink connects farmers and buyers through a smart pre-harvest booking system. With rain forecasting alerts and a secure wallet system, it minimizes crop loss and ensures smooth transactions.
hi: क्रिशिलिंक किसानों और खरीदारों को एक स्मार्ट प्री-हार्वेस्ट बुकिंग सिस्टम के माध्यम से जोड़ता है। बारिश पूर्वानुमान चेतावनियों और सुरक्षित वॉलेट सिस्टम के साथ, यह फ़सल नुकसान को कम करता है और सुचारु लेनदेन सुनिश्चित करता है।
mr: कृषी लिंक शेतकऱ्यांना आणि खरेदीदारांना स्मार्ट प्री-हार्वेस्ट बुकिंग सिस्टमद्वारे जोडते. पर्जन्य अंदाज सूचना आणि सुरक्षित वॉलेट सिस्टममुळे पीक तोटा कमी होतो आणि व्यवहार सुरळीत होतात.

source: Who Can Use KrishiLink?
hi: क्रिशिलिंक कौन उपयोग कर सकता है?
mr: कुण वापरू शकतो कृषी लिंक?

source: For Farmers
hi: किसानों के लिए
mr: शेतकऱ्यांसाठी

source: Farmers can list upcoming crops, accept pre-bookings, and receive early payment alerts. Our platform helps reduce dependency on middlemen and rain-damage risk.
hi: किसान आगामी फ़सलें सूचीबद्ध कर सकते हैं, प्री-बुकिंग स्वीकार कर सकते हैं और जल्दी भुगतान चेतावनी प्राप्त कर सकते हैं। हमारा प्लेटफ़ॉर्म मध्यस्थों पर निर्भरता और बारिश से होने वाले नुकसान के जोखिम को कम करने में मदद करता है।
mr: शेतकऱ्यांनी येणारी पीके सूचीबद्ध करू शकतात, प्री-बुकिंग स्वीकारू शकतात, आणि लवकर पेमेंट सूचना मिळवू शकतात. आमचे प्लॅटफॉर्म मध्यस्थांवरील अवलंबित्व आणि पर्जन्यामुळे होणारा धोका कमी करण्यात मदत करते.

source: For Buyers
hi: खरीदारों के लिए
mr: खरेदीदारांसाठी

source: Buyers get direct access to crops before they hit the market. Filter by crop type, harvest window or price and lock deals ahead of time. Real-time updates and wallet integration included.
hi: खरीदारों को फ़सलें सीधे बाजार में आने से पहले ही मिलती हैं। फ़सल प्रकार, हार्वेस्ट विंडो या कीमत द्वारा फ़िल्टर करें और डील पहले ही लॉक करें। रियल-टाइम अपडेट और वॉलेट एकीकरण शामिल है।
mr: खरेदीदारांना पीके थेट उपलब्ध होण्यापूर्वी प्रवेश मिळतो. पीक प्रकार, हार्वेस्ट विंडो किंवा किंमतानुसार फिल्टर करा आणि डील्स आधीपासून लॉक करा. रिअल-टाइम अपडेट्स आणि वॉलेट इंटिग्रेशन समाविष्ट आहे.

source: Contact Us
hi: हमसे संपर्क करें
mr: संपर्क साधा

source: Phone
hi: फ़ोन
mr: फोन

source: All Rights Reserved.
hi: सर्वाधिकार सुरक्षित।
mr: सर्व हक्क राखीव.

source: Welcome Back!
hi: वापसी पर स्वागत है!
mr: परत स्वागत आहे!

source: Password
hi: पासवर्ड
mr: पासवर्ड

source: Don’t have an account?
hi: खाता नहीं है?
mr: खाते नाही का?

source: Register here
hi: यहाँ पंजीकरण करें
mr: इथे नोंदणी करा

source: Forgot your password?
hi: पासवर्ड भूल गए?
mr: आपला पासवर्ड विसरलात?

source: Notifications
hi: सूचनाएं
mr: सूचना

source: Select Language
hi: भाषा चुनें
mr: भाषा निवडा

source: Notifications list
hi: सूचनाओं की सूची
mr: सूचनांची यादी

source: Your Notifications
hi: आपकी सूचनाएं
mr: आपल्या सूचना

source: Back to Dashboard
hi: डैशबोर्ड पर वापस जाएँ
mr: डॅशबोर्डकडे परत जा

source: Clear Selected
hi: चयनित हटाएँ
mr: निवडलेले साफ करा

source: Select All
hi: सभी चुनें
mr: सर्व निवडा

source: Mark as read
hi: पढ़ा हुआ मार्क करें
mr: वाचले म्हणून चिन्हांकित करा

source: Read
hi: पढ़ा हुआ
mr: वाचले

source: You have no notifications.
hi: आपके पास कोई सूचनाएं नहीं हैं।
mr: आपल्याकडे कोणतीही सूचना नाही.

source: Please select at least one notification to clear.
hi: कृपया कम से कम एक सूचना हटाने के लिए चुनें।
mr: कृपया साफ करण्यासाठी किमान एक सूचना निवडा.

source: Your Orders
hi: आपके ऑर्डर
mr: आपले ऑर्डर

source: Farmer info not available
hi: किसान की जानकारी उपलब्ध नहीं
mr: शेतकऱ्याची माहिती उपलब्ध नाही

source: You have no orders yet.
hi: आपके पास अभी तक कोई ऑर्डर नहीं है।
mr: आपल्याकडे अजून कोणतेही ऑर्डर नाहीत.

source: Mock UPI Payment
hi: मॉक यूपीआई भुगतान
mr: मॉक यूपीआय पेमेंट

source: Pay for Order #
hi: ऑर्डर # के लिए भुगतान करें
mr: ऑर्डर # साठी पैसे द्या

source: Amount to pay: ₹
hi: भुगतान की राशि: ₹
mr: देय रक्कम: ₹

source: Select Payment Method
hi: भुगतान विधि चुनें
mr: पेमेंट पद्धत निवडा

source: Pay via UPI (Mock)
hi: यूपीआई के माध्यम से भुगतान करें (मॉक)
mr: यूपीआयद्वारे पेमेंट करा (मॉक)

source: Pay via Wallet
hi: वॉलेट के माध्यम से भुगतान करें
mr: वॉलेटद्वारे पेमेंट करा

source: Cash on Delivery
hi: नकद भुगतान पर डिलीवरी
mr: रोख वितरणावर

source: Pay Now
hi: अभी भुगतान करें
mr: आता पैसे द्या

source: Enter your UPI ID (mock):
hi: अपना यूपीआई आईडी दर्ज करें (मॉक):
mr: आपला यूपीआय आयडी प्रविष्ट करा (मॉक):

source: UPI ID is required!
hi: यूपीआई आईडी आवश्यक है!
mr: UPI आयडी आवश्यक आहे!

source: Transaction ID:
hi: लेनदेन आईडी:
mr: व्यवहार आयडी:

source: Payment failed:
hi: भुगतान असफल:
mr: पेमेंट अयशस्वी:

source: Error:
hi: त्रुटि:
mr: त्रुटी:

source: Create Your Account
hi: अपना खाता बनाएं
mr: आपले खाते तयार करा

source: Username
hi: उपयोगकर्ता नाम
mr: वापरकर्तानाव

source: Password must be minimum 8 characters, include at least one letter, one number, and one special character
hi: पासवर्ड कम से कम 8 अक्षरों का होना चाहिए, जिसमें कम से कम एक अक्षर, एक संख्या और एक विशेष चिन्ह शामिल होना चाहिए।
mr: पासवर्ड किमान ८ अक्षरे असावा, त्यात किमान एक अक्षर, एक अंक आणि एक विशेष चिन्ह असावे

source: Role
hi: भूमिका
mr: भूमिका

source: Select role
hi: भूमिका चुनें
mr: भूमिका निवडा

source: Already have an account?
hi: क्या आपके पास पहले से खाता है?
mr: आधीच खाते आहे का?

source: Login here
hi: यहाँ लॉगिन करें
mr: इथे लॉगिन करा

source: Search Results for
hi: के लिए खोज परिणाम
mr: साठी शोध परिणाम

source: No crops found matching your search query.
hi: आपकी खोज के अनुरूप कोई फ़सल नहीं मिली।
mr: आपल्या शोधासाठी कोणतीही पीके सापडली नाहीत.

source: {editor}: Editing failed
hi: {editor}: संपादन विफल रहा
mr: {editor}: संपादन अयशस्वी

source: {editor}: Editing failed: {e}
hi: {editor}: संपादन विफल रहा: {e}
mr: {editor}: संपादन अयशस्वी: {e}

source: Options
hi: विकल्प
mr: पर्याय

source: Got unexpected extra argument ({args})
hi: अप्रत्याशित अतिरिक्त तर्क मिला ({args})
mr: अनपेक्षित अतिरिक्त आर्ग्युमेंट आले: ({args})

source: DeprecationWarning: The command {name!r} is deprecated.{extra_message}
hi: अधिसूचना: कमांड {name!r} अप्रचलित है।{extra_message}
mr: DeprecationWarning: आदेश {name!r} जुना झाला आहे.{extra_message}

source: Aborted!
hi: रद्द कर दिया गया!
mr: रद्द केले!

source: Commands
hi: कमांड्स
mr: आदेश

source: Missing command.
hi: कमांड गायब है।
mr: आदेश गहाळ आहे.

source: No such command {name!r}.
hi: कोई ऐसा कमांड {name!r} नहीं है।
mr: अशा प्रकारचा आदेश {name!r} नाही.

source: Value must be an iterable.
hi: मान एक iterable होना चाहिए।
mr: किंमत iterable असावी.

source: Takes {nargs} values but 1 was given.
hi: को {nargs} मान लेने चाहिए, लेकिन 1 दिया गया।
mr: {nargs} मूल्ये अपेक्षित आहेत, परंतु 1 दिले गेले.

source: DeprecationWarning: The {param_type} {name!r} is deprecated.{extra_message}
hi: अधिसूचना: {param_type} {name!r} अप्रचलित है।{extra_message}
mr: DeprecationWarning: {param_type} {name!r} जुना झाला आहे.{extra_message}

source: env var: {var}
hi: पर्यावरण चर: {var}
mr: पर्यावरण चल: {var}

source: default: {default}
hi: डिफ़ॉल्ट: {default}
mr: डीफॉल्ट: {default}

source: required
hi: आवश्यक
mr: आवश्यक

source: (dynamic)
hi: (गतिशील)
mr: (गतिक)

source: %(prog)s, version %(version)s
hi: %(prog)s, संस्करण %(version)s
mr: %(prog)s, आवृत्ती %(version)s

source: Show the version and exit.
hi: संस्करण दिखाएँ और बाहर निकलें।
mr: आवृत्ती दाखवा आणि बाहेर या.

source: Show this message and exit.
hi: यह संदेश दिखाएँ और बाहर निकलें।
mr: हा संदेश दाखवा आणि बाहेर या.

source: Error: {message}
hi: त्रुटि: {message}
mr: त्रुटी: {message}

source: Try '{command} {option}' for help.
hi: '{command} {option}' आज़माएँ सहायता के लिए।
mr: मदतीसाठी '{command} {option}' प्रयत्न करा.

source: Invalid value: {message}
hi: अमान्य मान: {message}
mr: अवैध मूल्य: {message}

source: Invalid value for {param_hint}: {message}
hi: {param_hint} के लिए अमान्य मान: {message}
mr: {param_hint} साठी अवैध मूल्य: {message}

source: Missing argument
hi: तर्क गायब है
mr: आर्ग्युमेंट गहाळ आहे

source: Missing option
hi: विकल्प गायब है
mr: पर्याय गहाळ आहे

source: Missing parameter
hi: पैरामीटर गायब है
mr: पॅरामीटर गहाळ आहे

source: Missing {param_type}
hi: {param_type} गायब है
mr: {param_type} गहाळ आहे

source: Missing parameter: {param_name}
hi: पैरामीटर गायब है: {param_name}
mr: पॅरामीटर गहाळ आहे: {param_name}

source: No such option: {name}
hi: कोई ऐसा विकल्प नहीं: {name}
mr: अशा पर्यायाचा पर्याय नाही: {name}

source: Did you mean {possibility}?
hi: क्या आप {possibility} कहना चाहते हैं?
mr: आपल्याला {possibility} म्हणायचे होते का?

source: unknown error
hi: अज्ञात त्रुटि
mr: अज्ञात त्रुटी

source: Could not open file {filename!r}: {message}
hi: फ़ाइल {filename!r} खोल नहीं सकते: {message}
mr: फाइल {filename!r} उघडता आली नाही: {message}

source: Usage:
hi: उपयोग:
mr: वापर:

source: Argument {name!r} takes {nargs} values.
hi: तर्क {name!r} को {nargs} मान चाहिए।
mr: आर्ग्युमेंट {name!r} {nargs} मूल्ये घेते.

source: Option {name!r} does not take a value.
hi: विकल्प {name!r} मान नहीं लेता।
mr: पर्याय {name!r} मूल्य घेत नाही.

source: Option {name!r} requires an argument.
hi: विकल्प {name!r} को एक तर्क चाहिए।
mr: पर्याय {name!r} ला आर्ग्युमेंट आवश्यक आहे.

source: Shell completion is not supported for Bash versions older than 4.4.
hi: Bash संस्करण 4.4 से पुराने के लिए शेल पूर्णता समर्थित नहीं है।
mr: Bash 4.4 आधीच्या आवृत्त्यांसाठी शेल पूर्णता समर्थित नाही.

source: Couldn't detect Bash version, shell completion is not supported.
hi: Bash संस्करण पता नहीं चल सका, शेल पूर्णता समर्थित नहीं है।
mr: Bash आवृत्ती ओळखू शकली नाही, शेल पूर्णता समर्थित नाही.

source: Repeat for confirmation
hi: पुष्टि के लिए दोहराएँ
mr: पुष्टीसाठी पुनरावृत्ती करा

source: Error: The value you entered was invalid.
hi: त्रुटि: आपने जो मान दर्ज किया वह अमान्य था।
mr: त्रुटी: आपण दिलेले मूल्य अवैध आहे.

source: Error: {e.message}
hi: त्रुटि: {e.message}
mr: त्रुटी: {e.message}

source: Error: The two entered values do not match.
hi: त्रुटि: दोनों दर्ज किए गए मान मेल नहीं खाते।
mr: त्रुटी: दोन दिलेली मूल्ये जुळत नाहीत.

source: Error: invalid input
hi: त्रुटि: अमान्य इनपुट
mr: त्रुटी: अवैध इनपुट

source: Press any key to continue...
hi: जारी रखने के लिए कोई भी कुंजी दबाएँ...
mr: सुरू ठेवण्यासाठी कोणतीही की दाबा...

source: Choose from: {choices}
hi: इनमें से चुनें: {choices}
mr: यामधून निवडा: {choices}

source: {value!r} is not {choice}.
hi: {value!r} {choice} नहीं है।
mr: {value!r} हे {choice} नाही.

source: {value!r} does not match the format {format}.
hi: {value!r} प्रारूप {format} से मेल नहीं खाता।
mr: {value!r} हा {format} फॉरमॅटशी जुळत नाही.

source: {value!r} is not a valid {number_type}.
hi: {value!r} मान्य {number_type} नहीं है।
mr: {value!r} वैध {number_type} नाही.

source: {value} is not in the range {range}.
hi: {value} सीमा {range} में नहीं है।
mr: {value} हा {range} रेंजमध्ये नाही.

source: {value!r} is not a valid boolean.
hi: {value!r} मान्य boolean नहीं है।
mr: {value!r} वैध बूलियन नाही.

source: {value!r} is not a valid UUID.
hi: {value!r} मान्य UUID नहीं है।
mr: {value!r} वैध UUID नाही.

source: file
hi: फ़ाइल
mr: फाइल

source: directory
hi: निर्देशिका
mr: डिरेक्टरी

source: path
hi: पथ
mr: पथ

source: {name} {filename!r} does not exist.
hi: {name} {filename!r} मौजूद नहीं है।
mr: {name} {filename!r} अस्तित्वात नाही.

source: {name} {filename!r} is a file.
hi: {name} {filename!r} एक फ़ाइल है।
mr: {name} {filename!r} ही फाइल आहे.

source: {name} {filename!r} is a directory.
hi: {name} {filename!r} एक निर्देशिका है।
mr: {name} {filename!r} ही डिरेक्टरी आहे.

source: {name} {filename!r} is not readable.
hi: {name} {filename!r} पढ़ने योग्य नहीं है।
mr: {name} {filename!r} वाचता येत नाही.

source: {name} {filename!r} is not writable.
hi: {name} {filename!r} लिखने योग्य नहीं है।
mr: {name} {filename!r} लिहिता येत नाही.

source: {name} {filename!r} is not executable.
hi: {name} {filename!r} निष्पादन योग्य नहीं है।
mr: {name} {filename!r} चालवता येत नाही.

source: {len_type} values are required, but {len_value} was given.
hi: {len_type} मान आवश्यक हैं, लेकिन {len_value} दिए गए।
mr: {len_type} मूल्यांची आवश्यकता आहे, परंतु {len_value} दिली गेली.

source: हिन्दी
mr: हिंदी
